Catalogs/ЭлектронныеРесурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЭлектронныеРесурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SCO</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдинственныйЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыЭлектронныхРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыЭлементовЭлектронныхРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовЭлектронныхРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>File</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Folder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Media</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Image</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Video</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Audio</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Document</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DataProcessor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Text</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Presentation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Table</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YouTube</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭлементыЭлектронныхРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЭлементыЭлектронныхРесурсов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭлектронныеРесурсы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовЭлектронныхРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроигрыватьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВнешнийЭлемент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеЭлемента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОбмена</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеДляИндексирования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Гиперссылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементСодержания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраницыЭлементовЭлектронныхКурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭлектронныеРесурсы/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает единственный элемент ресурса.
//
// Если в ресурсе нет элементов или их больше одного,
// включая группы, то возвращает Неопределено.
// Помимо этой функции единственный элемент можно
// получить из реквизита ресурса.
//
Функция ЕдинственныйЭлемент(Ресурс) Экспорт	 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ЭлементыЭлектронныхКурсов.Ссылка
		|ИЗ
		|	Справочник.ЭлементыЭлектронныхРесурсов КАК ЭлементыЭлектронныхКурсов
		|ГДЕ
		|	ЭлементыЭлектронныхКурсов.ПометкаУдаления = ЛОЖЬ
		|	И ЭлементыЭлектронныхКурсов.Владелец = &Ресурс";

	Запрос.УстановитьПараметр("Ресурс", Ресурс);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда		
		ВыборкаДетальныеЗаписи.Следующий();		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;		
	Иначе		
		Возврат Неопределено;		
	КонецЕсли;		
	
КонецФункции

Функция ДеревоЭлементов(Ресурс) Экспорт
	 
	// Делаем проверки
	//
	
	ДанныеРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ресурс, "SCO");
	
	// Выбираем все элементы ресурса
	//
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЭлементыРесурса.Ссылка КАК Ссылка,
	               |	ЭлементыРесурса.ИмяФайла КАК ИмяФайла,
	               |	ЭлементыРесурса.ЭтоГруппа КАК ЭтоГруппа,
	               |	ЭлементыРесурса.Наименование КАК Наименование,
	               |	ЭлементыРесурса.Владелец КАК Владелец,
	               |	ЭлементыРесурса.Тип КАК ТипЭлемента,
	               |	ЭлементыРесурса.ЭтоВнешнийЭлемент КАК ЭтоВнешнийЭлемент,
	               |	ЭлементыРесурса.ДатаИзменения КАК ДатаИзменения,
	               |	ВЫБОР
	               |		КОГДА ЭлементыРесурса.ЭтоГруппа
	               |			ТОГДА 2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Картинка
	               |ИЗ
	               |	Справочник.ЭлементыЭлектронныхРесурсов КАК ЭлементыРесурса
	               |ГДЕ
	               |	ЭлементыРесурса.ПометкаУдаления = ЛОЖЬ
	               |	И ЭлементыРесурса.Владелец = &Ресурс
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование ИЕРАРХИЯ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	
	ВыборкаВсехФайловРесурса = Запрос.Выполнить();
	ДеревоФайловРесурса      = ВыборкаВсехФайловРесурса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Если НЕ ДанныеРесурса.SCO Тогда // Ресурсы SCORM никак не меняем
		ПодготовитьДеревоЭлементовДляВыгрузки(ДеревоФайловРесурса.Строки);	
	КонецЕсли;
		
	// Завершаем
	//
	
	Возврат ДеревоФайловРесурса;
	
КонецФункции

Процедура ПодготовитьДеревоЭлементовДляВыгрузки(СтрокиДереваФайлов)
	
	Для каждого Строка Из СтрокиДереваФайлов Цикл
		
		Если Строка.ЭтоВнешнийЭлемент <> Истина Тогда // Явное сравнение, так как для группы значение равно NULL
			Строка.ИмяФайла = Справочники.ЭлементыЭлектронныхРесурсов.ИмяФайлаДляВыгрузки(Строка.Ссылка, Строка.ИмяФайла, Строка.ТипЭлемента);
		КонецЕсли;		
			
		Если Строка.Строки.Количество() > 0 Тогда
			ПодготовитьДеревоЭлементовДляВыгрузки(Строка.Строки); // Рекурсия
		КонецЕсли;		
		
	КонецЦикла;
		
КонецПроцедуры

Функция СтруктураФайловРесурса(Ресурс, СтрокиДереваФайлов, Знач УровеньВложенности, ЭлектронныйКурс, ИдентификаторФормы = Неопределено) Экспорт
			
	МассивФайлов = Новый Массив();
	
	Если СтрокиДереваФайлов.Количество() = 0 Тогда
		Возврат МассивФайлов;
	КонецЕсли;
	
	Для каждого Строка Из СтрокиДереваФайлов Цикл
		
		Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.YouTube Тогда		
			Продолжить; // Нет файла для этого типа элемента ресурса
		КонецЕсли;
		
		Файл = ПустаяСтруктураФайлаДляВыгрузки();
		ФайлНаПодмену = Неопределено;
		
		Файл.ИмяФайла = Строка.ИмяФайла;
		Файл.ЭтоКаталог = Строка.ЭтоГруппа;
		
		Если Строка.ЭтоГруппа Тогда
			
			МассивФайловРесурса = СтруктураФайловРесурса(Ресурс, Строка.Строки, УровеньВложенности + 1, ЭлектронныйКурс, ИдентификаторФормы); // Рекурсия
			Файл.ПодчиненныеФайлы = МассивФайловРесурса;
			
		Иначе
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Text Тогда
				
				ФорматированныйДокумент = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента);
				ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
				ФорматированныйДокументСтруктура = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокумент, Строка.Ссылка.УникальныйИдентификатор(),, Истина, Ложь, ОтносительныйПутьККаталогуРесурсов);
				
				Файл.ИмяФайла = ""; // Чтобы распаковался в корень ресурса				
				Файл.ТипЭлемента = "Folder";
				Файл.ДвоичныеДанные = ФорматированныйДокументСтруктура.ДвоичныеДанные;
				
			ИначеЕсли Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Document
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Presentation
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.HTML Тогда
				
				Файл.ИмяФайла = ""; // Чтобы распаковался в корень ресурса
				Файл.ТипЭлемента = "Folder";
				Файл.ДвоичныеДанные = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента, ИдентификаторФормы);
				
			ИначеЕсли Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Video Тогда	
				
				ФорматДляВыгрузки = Справочники.ЭлементыЭлектронныхРесурсов.ФорматВидеоФайлаДляВыгрузки(Строка.Ссылка);				
				Файл.ИмяФайла = "video." + НРег(ФорматДляВыгрузки);				
				Файл.ДвоичныеДанные = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента, ИдентификаторФормы);								
				
			ИначеЕсли Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Audio Тогда	
				
				ФорматДляВыгрузки = НРег(ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(Строка.ИмяФайла)));
				Файл.ИмяФайла = "audio." + ФорматДляВыгрузки;				
				Файл.ДвоичныеДанные = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента, ИдентификаторФормы);
				
			ИначеЕсли Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.File
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Image
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.DataProcessor
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Media Тогда	
				
				Файл.ИмяФайла = Строка.ИмяФайла;				
				Файл.ДвоичныеДанные = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента, ИдентификаторФормы);
				
			ИначеЕсли Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Folder Тогда
				
				Файл.ИмяФайла = Строка.ИмяФайла;				
				Файл.ТипЭлемента = "Folder";
				Файл.ДвоичныеДанные = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента, ИдентификаторФормы);
				
			Иначе
				
				ВызватьИсключение НСтр("ru = 'Неизвестный тип элемента'");
				
			КонецЕсли;				
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Document
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.HTML Тогда
				
				// Получаем описание картинок
				
				ДанныеКартинок = Неопределено;
				
				Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Document Тогда
					ДанныеКартинок = РазработкаЭлектронныхКурсовСлужебный.НастройкиКартинокДокументаWordДляПубликации(Строка.Ссылка);
				КонецЕсли;
				
				// Подключаем API к документам и HTML
				
				НовыеДвоичныеДанные = ПодключитьAPIКФайлу(Файл.ДвоичныеДанные, ДанныеКартинок);
				
				ФайлНаПодмену = ПустаяСтруктураФайлаДляВыгрузки(); // Файл заменит оригинальный index.html
				ФайлНаПодмену.ДвоичныеДанные = НовыеДвоичныеДанные;
				ФайлНаПодмену.ИмяФайла = "index.html";
				ФайлНаПодмену.ЭтоКаталог = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивФайлов.Добавить(Файл);
		
		Если ФайлНаПодмену <> Неопределено Тогда
			МассивФайлов.Добавить(ФайлНаПодмену);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции

Функция ПустаяСтруктураФайлаДляВыгрузки() Экспорт
	
	Файл = Новый Структура;
	
	Файл.Вставить("ИмяФайла", "");
	Файл.Вставить("ЭтоКаталог", "");
	Файл.Вставить("ДвоичныеДанные", Неопределено);
	Файл.Вставить("ПодчиненныеФайлы", Неопределено);
	Файл.Вставить("ТипЭлемента", Неопределено); // Строка

	Возврат Файл;
	
КонецФункции

Функция ЭлементРесурсаПоОтносительномуПути(Знач Ресурс, Знач ОтносительныйПутьКФайлу) Экспорт
	
	РазделительПути = ЭлектронноеОбучениеСлужебныйКлиентСервер.РазделительПути(ОтносительныйПутьКФайлу);
	ОтносительныйПутьМассив = СтрРазделить(ОтносительныйПутьКФайлу, РазделительПути, Ложь);
	КоличествоЭлементовПути = ОтносительныйПутьМассив.Количество();
	ИмяФайла = ОтносительныйПутьМассив[КоличествоЭлементовПути-1];
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлементыЭлектронныхРесурсов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлементыЭлектронныхРесурсов КАК ЭлементыЭлектронныхРесурсов
		|ГДЕ
		|	ЭлементыЭлектронныхРесурсов.ПометкаУдаления = ЛОЖЬ
		|	И ЭлементыЭлектронныхРесурсов.ИмяФайла = &ИмяФайла
		|	И ЭлементыЭлектронныхРесурсов.Владелец = &Ресурс";
	
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);	
		
	УровеньРодителя = 1;
	
	Пока УровеньРодителя < КоличествоЭлементовПути Цикл
		
		ИмяФайлаРодителя = ОтносительныйПутьМассив[УровеньРодителя - 1];
		ИмяПараметра = "ИмяКаталог" + ЭлектронноеОбучениеСлужебныйКлиентСервер.ЧислоВСтроку(УровеньРодителя);
		ТекстУсловия = " И ЭлементыЭлектронныхРесурсов.";
		
		Для Счетчик = 1 По УровеньРодителя Цикл			
			ТекстУсловия = ТекстУсловия + "Родитель."			
		КонецЦикла;
		
		ТекстУсловия = ТекстУсловия + "ИмяФайла = &" + ИмяПараметра;			
		Запрос.Текст = Запрос.Текст + ТекстУсловия;
		Запрос.УстановитьПараметр(ИмяПараметра, ИмяФайлаРодителя);
		
		УровеньРодителя = УровеньРодителя + 1;
		
	КонецЦикла;		
	
	ИмяПараметра = "ПоследнийРодитель";
	ТекстУсловия = " И ЭлементыЭлектронныхРесурсов.";
	
	Для Счетчик = 1 По УровеньРодителя Цикл			
		ТекстУсловия = ТекстУсловия + "Родитель."			
	КонецЦикла;		
	
	ТекстУсловия = Лев(ТекстУсловия, СтрДлина(ТекстУсловия)-1);
	ТекстУсловия = ТекстУсловия + " = &" + ИмяПараметра;		
	Запрос.Текст = Запрос.Текст + ТекстУсловия;
	
	Запрос.УстановитьПараметр(ИмяПараметра, Справочники.ЭлементыЭлектронныхРесурсов.ПустаяСсылка());		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

// Возвращает путь к элементу относительно каталога ресурсов
//
Функция ОтносительныйПутьКЭлементуРесурса(Знач ЭлементРесурса, ДеревоЭлементовРесурса = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлементРесурса) Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно определить путь для пустого элемента электронного ресурса'");
	КонецЕсли;
	
	ДанныеФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементРесурса, "Владелец, ЭтоВнешнийЭлемент");	
	
	Если ДанныеФайла.ЭтоВнешнийЭлемент Тогда
		Возврат ДанныеФайла.ИмяФайла;
	КонецЕсли;	
	
	Ресурс = ДанныеФайла.Владелец;	
	
	Если ДеревоЭлементовРесурса = Неопределено Тогда
		ДеревоЭлементовРесурса = ДеревоЭлементов(Ресурс);
	КонецЕсли;	
	
	СтрокаДерева = НайтиЭлементВДереве(ДеревоЭлементовРесурса.Строки, ЭлементРесурса);
	
	Если СтрокаДерева = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Элемент %1 не найден в ресурсе %2'"), ЭлементРесурса, Ресурс);
	КонецЕсли;
	
	ПутьКЭлементу = СтрокаДерева.ИмяФайла; // Имя файла берем из дерева, так как оно там меняется
	РодительЭлемента = СтрокаДерева.Родитель;
	
	Пока РодительЭлемента <> Неопределено Цикл
		ПутьКЭлементу = РодительЭлемента.ИмяФайла + "/" + ПутьКЭлементу;
		РодительЭлемента = РодительЭлемента.Родитель;
	КонецЦикла;
	
	ПутьКЭлементу = Строка(Ресурс.УникальныйИдентификатор()) + "/" + ПутьКЭлементу;	// Добавляем каталог ресурса
	
	Возврат ПутьКЭлементу;   
	
КонецФункции

Функция НайтиЭлементВДереве(СтрокиДереваЭлементов, ЭлементРесурса)
	
	НайденныйЭлемент = Неопределено;
	
	Для каждого Строка Из СтрокиДереваЭлементов Цикл

		Если Строка.Ссылка = ЭлементРесурса Тогда
			НайденныйЭлемент = Строка;
			Прервать;
		КонецЕсли;

		Если Строка.ЭтоГруппа И НайденныйЭлемент = Неопределено Тогда
			НайденныйЭлемент = НайтиЭлементВДереве(Строка.Строки, ЭлементРесурса); // Рекурсия
		КонецЕсли;

		Если НайденныйЭлемент <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныйЭлемент;
	
КонецФункции

Функция ПодключитьAPIКФайлу(ДвоичныеДанные, ДанныеКартинок = Неопределено)
		
	МассивФайловНаУдаление = Новый Массив;
		
	ВременныйФайлZIP = ПолучитьИмяВременногоФайла(".zip");
	МассивФайловНаУдаление.Добавить(ВременныйФайлZIP);
	ДвоичныеДанные.Записать(ВременныйФайлZIP);
	ФайлАрхива = Новый ЧтениеZIPФайла(ВременныйФайлZIP);
	
	ЭлементФайлаHTML = ФайлАрхива.Элементы.Найти("index.html");
	
	Если ЭлементФайлаHTML = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка структуры архива с файлом HTML'");
	КонецЕсли;
	
	ПутьКВременномуКаталогуАрхива = ПолучитьИмяВременногоФайла("");
    МассивФайловНаУдаление.Добавить(ПутьКВременномуКаталогуАрхива);
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьКВременномуКаталогуАрхива);
	ФайлАрхива.Извлечь(ЭлементФайлаHTML, ПутьКВременномуКаталогуАрхива, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	ФайлАрхива.Закрыть();
	
	ПутьКВременномуФайлуЧтение = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКВременномуКаталогуАрхива);
	ПутьКВременномуФайлуЧтение = ПутьКВременномуФайлуЧтение + "index.html";			
	
	МассивФайловНаУдаление.Добавить(ПутьКВременномуФайлуЧтение);
	
	ВременныйФайлЧтение = Новый ЧтениеТекста(ПутьКВременномуФайлуЧтение, КодировкаТекста.UTF8); 
	ВесьФайлСтрока = ВременныйФайлЧтение.Прочитать();
	ВременныйФайлЧтение.Закрыть();
	
	ВесьФайлСтрокаНРег = НРег(ВесьФайлСтрока);
	НомерСимволаBody = СтрНайти(ВесьФайлСтрокаНРег, "</body>");
	ВесьФайлСтрокаНРег = Неопределено;
	
	Если НомерСимволаBody = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось подключить API к HTML файлу'");
	КонецЕсли;
	
	ТекстСкрипта = "";
	
	Если ДанныеКартинок <> Неопределено Тогда
		ТекстСкрипта = ТекстСкрипта + "<script>" + ДанныеКартинок + "</script>";
	КонецЕсли;
	
	ТекстСкрипта = ТекстСкрипта + "<script type=""text/javascript"" src=""../../res.js""></script>";
	
	ВесьФайлНоваяСтрока = Сред(ВесьФайлСтрока, 1, НомерСимволаBody-1) + ТекстСкрипта + Сред(ВесьФайлСтрока, НомерСимволаBody);
	
	ПутьКВременномуФайлуЗапись = ПолучитьИмяВременногоФайла(".html");
	МассивФайловНаУдаление.Добавить(ПутьКВременномуФайлуЗапись);
	ВременныйФайлЗапись = Новый ЗаписьТекста(ПутьКВременномуФайлуЗапись, КодировкаТекста.UTF8); 
	ВременныйФайлЗапись.Записать(ВесьФайлНоваяСтрока);	
	
	ВременныйФайлЗапись.Закрыть();	
	
	НовыеДвоичныеДанные = Новый ДвоичныеДанные(ПутьКВременномуФайлуЗапись);
	
	// Удаляем временные файлы
	
	Для каждого ПутьКВременномуФайлу Из МассивФайловНаУдаление Цикл

		Попытка
			УдалитьФайлы(ПутьКВременномуФайлу);
		Исключение
			ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось удалить временный файл
				|%1 по причине: %2'"), ПутьКВременномуФайлу, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()))
			);
		КонецПопытки;	

	КонецЦикла;	
	
	// Возвращаем результат
	
	Возврат НовыеДвоичныеДанные;
	
КонецФункции

#КонецОбласти

#КонецЕсли
